[
  {
    "version": "3.0.0",
    "date": "December 24, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added support for background removal tool in Docs page with real-time preview and offline processing.",
          "Added support for EXIF removal tool in Docs page with real-time preview and offline processing.",
          "Added new background removal and EXIF removal content files for both Persian and English locales to manage UI texts without relying on t() keys.",
          "Added locale-based hooks to read background removal and EXIF removal UI content consistently for Persian/English."
        ]
      },
      {
        "category": "improved",
        "items": [
          "Improved background removal and EXIF removal architecture by separating UI strings from components and aligning them with the bilingual content structure.",
          "Improved maintainability of the background removal and EXIF removal codebase to speed up future iterations.",
          "Improved rendering of background removal and EXIF removal badges and sidebar entries using a maintainable category map."
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed mismatches between background removal and EXIF removal t() keys and actual language content by moving UI strings into content files.",
          "Fixed background removal and EXIF removal category label rendering in bilingual mode.",
          "Fixed minor background removal and EXIF removal navigation text inconsistencies by using centralized content strings."
        ]
      }
    ]
  },
  {
    "version": "2.9.2 BETA",
    "date": "December 18, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added standalone content files for Docs page and DocSection (content-based UI) to manage UI texts without relying on t() keys.",
          "Added localized labels for the new docs categories: pdf, image, developer, security, utility, system, excel, audio, powerpoint.",
          "Added locale-based hooks to read Docs UI content consistently for Persian/English."
        ]
      },
      {
        "category": "improved",
        "items": [
          "Improved Docs architecture by separating UI strings from components and aligning them with the bilingual content structure.",
          "Improved category rendering in the sidebar and section badges using a maintainable category map.",
          "Improved maintainability of the Docs codebase to speed up future iterations."
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed mismatches between Docs/DocSection t() keys and actual language content by moving UI strings into content files.",
          "Fixed docs category label rendering in bilingual mode (especially for newly added categories).",
          "Fixed minor Docs navigation text inconsistencies (Prev/Next/Back/Footer) by using centralized content strings."
        ]
      }
    ]
  },
  {
    "version": "2.9.1",
    "date": "December 17, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added full support for Persian numbers and various separators (comma, space) in Excel editor.",
          "Added new features for managing Persian numeric data and improved filter/sort functionality for these numbers."
        ]
      },
      {
        "category": "improved",
        "items": [
          "Improved Excel tool code structure by splitting it into multiple files (types, utils, hooks, logic, component) for better readability and maintainability.",
          "Improved table scroll and display of out-of-view data on mobile and desktop.",
          "Improved user experience by applying all UI texts from bilingual JSON content."
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed TypeScript errors in Excel-related sections (such as DataRow type definition and function recognition).",
          "Fixed table scroll issues in fullscreen and mobile modes.",
          "Fixed errors related to Blob management and file output in the Excel tool."
        ]
      }
    ]
  },
  {
    "version": "2.9.0 BETA",
    "date": "December 17, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added full Persian and English language support for all tools and UIs, with all UI texts connected to a bilingual JSON content structure.",
          "Added new bilingual tools: 'Unit Converter', 'QR Code Generator', 'Date Converter', 'Word & Character Counter', and 'User Agent & Environment Info'.",
          "Improved internal language and RTL/LTR structure for all tools and pages."
        ]
      },
      {
        "category": "improved",
        "items": [
          "Optimized page loading and display using dynamic Viewport units and fixed scroll jumps on mobile devices.",
          "Improved memory management and proper Blob URL revocation when switching files or regenerating output in all editing tools (PDF, Excel, Word).",
          "Improved layout and user experience for mobile and tablet devices, focusing on fast page selection and file management.",
          "Increased response speed and optimized internal server for desktop and offline usage.",
          "Added advanced features for Persian text display and editing in all tools (including layout and font fixes)."
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed TypeScript build errors when creating Blobs by properly converting Uint8Array to ArrayBuffer.",
          "Fixed preview state and output tab inconsistencies in editing tools after multiple output generations.",
          "Fixed edge cases in page selection and page count management after replacing files.",
          "Fixed CSS/JS loading and 404 errors in the desktop version by updating the internal server and adding complete fallbacks for .html and .txt files."
        ]
      }
    ]
  },
  {
    "version": "2.8.1 BETA",
    "date": "December 13, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "PDF Editor: Added a mobile-first preview strategy with explicit \"Open\" (new tab) fallback on devices that do not reliably render PDFs inline",
          "PDF Editor: Added viewer tabs to switch between Original and Edited documents (when an edited output is available)",
          "PDF Editor: Added clearer selection UX for pages (active page state + selected badge) to speed up multi-page workflows on small screens"
        ]
      },
      {
        "category": "improved",
        "items": [
          "PDF Editor: Fully extracted remaining hard-coded UI strings into bilingual JSON content and unified button labels across RTL/LTR",
          "PDF Editor: Improved mobile layout and viewer height behavior using dynamic viewport units to reduce layout jumps on scroll",
          "PDF Editor: Improved memory management by revoking Blob URLs consistently when switching files or regenerating output"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "PDF Editor: Fixed a TypeScript build error when creating a Blob from pdf-lib output by converting Uint8Array to a real ArrayBuffer before Blob creation",
          "PDF Editor: Fixed inconsistent preview state when switching between Original/Edited after regenerating the output multiple times",
          "PDF Editor: Fixed edge cases where page count or selection state could become stale after replacing the uploaded file",
          "Word to PDF: Fixed Persian text rendering/layout issues caused by font handling/substitution during conversion"
        ]
      }
    ]
  },
  {
    "version": "2.8.0 BETA",
    "date": "December 12, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added the new Excel Editor tool (beta) with bilingual UI texts and metadata integration",
          "Introduced the first Windows desktop (portable) build for offline usage",
          "Added an internal local HTTP server for the desktop build to serve the static export reliably (instead of loading with file://)"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Improved desktop routing compatibility with DirectAdmin-style static export output (html/txt route files and __next.*.txt assets)",
          "Enhanced route resolving in the desktop build to support both /path and /path/ and map them to the correct .html/.txt files",
          "Reduced runtime dependency risk in the desktop package by removing non-essential server dependencies from production runtime"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed missing CSS/JS assets in the desktop build by serving export output over http://127.0.0.1",
          "Fixed 'Cannot find module serve-handler' error in the packaged app",
          "Fixed 404 errors on non-home pages in the desktop build by adding full .html/.txt fallbacks in the internal server"
        ]
      }
    ]
  },
  {
    "version": "2.7.2 BETA",
    "date": "December 12, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "HTML to PPTX: CSS extraction support from <style> tags and inline style attributes, with fallback defaults when no styles are present",
          "HTML to PPTX: Basic cascade handling based on selector specificity and rule order for more accurate styling results"
        ]
      },
      {
        "category": "improved",
        "items": [
          "HTML to PPTX: More stable text rendering by generating rich text runs (bold/italic/underline/color/font size) for headings and paragraphs while keeping list bullets stable",
          "HTML to PPTX: Better unit parsing for font-size and margins (px, pt, rem, em, %) to reduce style mismatches when converting",
          "HTML to PPTX: Performance improvements using resolved-style caching to avoid repeated selector matching on large HTML inputs"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed a TypeScript build error caused by dynamic assignment on indexed keys during CSS inheritance merging",
          "Fixed rare parsing issues when HTML contains unsupported/invalid CSS selectors by safely ignoring invalid selectors during matching"
        ]
      }
    ]
  },
  {
    "version": "2.7.1 BETA",
    "date": "December 11, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Introduced a new floating bottom navigation on mobile with a dedicated Docs shortcut and a compact FAB-style menu for quick access to other pages",
          "Added glassmorphism-style header and footer containers to better match the overall visual identity of ToolsManager"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Refined the mobile layout of the tools grid: category filters are now shown as a horizontal chip row and call-to-action text stays visible without relying on hover",
          "Adjusted global spacing and bottom padding on mobile pages so content no longer sits under the floating bottom navigation",
          "Polished the Theme switcher dropdown positioning so it stays fully visible in both Persian (RTL) and English (LTR) layouts",
          "Unified scrollbar styling across the app with a subtle, theme-friendly custom scrollbar"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed several minor alignment issues in cards and footer content when switching between light and dark themes",
          "Resolved a visual glitch where the mobile navigation buttons could overlap page content in very small viewports"
        ]
      }
    ]
  },
  {
    "version": "2.7.0 BETA",
    "date": "December 11, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added URL loading support to image tools such as Image Resizer, Image Compressor and Image to PDF, with fully client‑side processing and no file uploads to any server",
          "Introduced a new \"Image editor\" tool with core features like crop, rotate, flip, brightness/contrast adjustment and simple filters applied directly in the browser",
          "Defined centralized bilingual metadata for the Image Editor tool, including title, description, canonical URL and JSON‑LD structured data for better SEO",
          "Added a dedicated Image Editor section to the Docs page with technical details, usage examples and clear privacy notes"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Refined output filename conventions across image tools using clearer patterns such as \"edited-{timestamp}.{ext}\" and \"resized-{width}x{height}.{ext}\" based on the actual MIME type of the image",
          "Standardized privacy messages across all image tools (Resize, Compress, Image to PDF, Image to SVG and Image Editor) to consistently highlight 100% client‑side processing",
          "Optimized memory usage and Blob/File lifecycle management in image tools to avoid memory leaks when repeatedly changing images or keeping tools open for long sessions",
          "Improved error and helper messages when loading images from URLs, including clearer feedback for CORS issues, invalid links and non‑image responses"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed incorrect output extension detection in the Image Resizer when working with URL‑based images that have no file extension or long query strings",
          "Resolved an issue where the previous preview image could remain visible in the Resizer and Compressor after clearing the file and selecting a new one",
          "Fixed minor inconsistencies in note/alert (info / warning / error) styles in the Docs page when toggling between light and dark themes",
          "Addressed several rare crashes in image tools when handling extremely large images by adding better Canvas error handling and guard conditions"
        ]
      }
    ]
  },
  {
    "version": "2.6.0 BETA",
    "date": "December 10, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added new \"Extract audio from video\" tool with support for MP4, AVI, MOV, MKV and WEBM input formats and output in four formats: MP3, WAV, OGG and M4A",
          "Three quality level options (low, medium, high) with corresponding bitrate display for each output format",
          "Real‑time percentage progress bar during audio extraction with helpful guidance messages to prevent user confusion",
          "Full client‑side processing using FFmpeg.wasm with no file upload to any server",
          "Automatic display of video duration and file size after upload",
          "Important warning before extraction about potential processing time for large videos and temporary browser slowdown",
          "In‑progress notification reminding users to be patient and not close the browser window",
          "Complete bilingual metadata for the audio extractor tool including title, description, canonical URL and JSON‑LD",
          "Dedicated section for the audio extractor in the Docs page with full technical details and privacy notes"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Enhanced \"Image resizer\" tool with live image preview, current dimensions display alongside original dimensions and a reset‑to‑original button",
          "Added pixel unit (px) labels to width and height inputs in the image resizer for better clarity",
          "Improved aspect‑ratio lock status display with an informative blue note explaining that changing one dimension auto‑adjusts the other",
          "Fully extracted all UI strings for the image resizer into bilingual JSON files and removed all hard‑coded text from the main component",
          "Better memory management in the image resizer by using FileReader and readAsDataURL instead of URL.createObjectURL for preview rendering",
          "Added smooth animations with Framer Motion when switching between upload and edit modes in the image resizer",
          "Improved output image quality by setting imageSmoothingQuality to 'high' and quality to 0.95 in the resizer",
          "Changed output filename format to 'resized-{width}x{height}.{ext}' for better transparency"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed 'ffmpeg.wasm does not support nodejs' error by dynamically importing FFmpeg only on the client side and preventing execution during SSR",
          "Resolved image preview not displaying in the resizer by switching from URL.createObjectURL to FileReader for loading",
          "Fixed missing warnings and guidance messages in the audio extractor due to outdated translation JSON files",
          "Removed redundant isClient state that prevented the component from rendering on first load and replaced it with a simple typeof window check"
        ]
      }
    ]
  },
  {
    "version": "2.5.5 BETA",
    "date": "December 9, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added the new \"Image to SVG vector\" tool under the Image category, performing fully client‑side raster‑to‑vector conversion (Canvas + ImageTracerJS) with side‑by‑side preview of the original image and SVG output plus direct SVG download for editing in vector tools",
          "Introduced dedicated bilingual metadata and JSON‑based config for the new Image to SVG tool, including title, description, canonical URL, JSON‑LD structured data and a dedicated section in the Docs page"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Extended the theme system with dedicated design tokens for notes and alerts (info / warning / error) and updated Docs and tools to use these tokens instead of hard‑coded Tailwind color classes for better light/dark consistency",
          "Added theme configuration for scrollbar colors and divider gradients and applied it to the Docs layout so scrollbars and separators follow the active theme instead of fixed colors",
          "Moved all UI strings for the Image to SVG tool (including the large‑image performance warning and usage notes) into JSON translation files and wired them to the LanguageContext/i18n system for full bilingual support",
          "Updated the Docs section component to render technical and privacy notes using theme‑driven note styles instead of yellow/green hard‑coded backgrounds in light and dark modes"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed a TypeScript build error related to the imagetracerjs library by adding a custom .d.ts declaration file, preventing implicit any for the Image to SVG conversion module",
          "Removed remaining hard‑coded strings and colors from Docs and image‑related tools and aligned them with the centralized theming and translation infrastructure"
        ]
      }
    ]
  },
  {
    "version": "2.5.0 BETA",
    "date": "December 8, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added the new \"HTML to PowerPoint (PPTX)\" tool with support for multiple slides, automatic detection of headings, paragraphs, lists and simple tables, and mapping them to fully editable PowerPoint slides",
          "Client‑side PPTX generation entirely in the browser, with no file upload to any server, to keep conversions fast and privacy‑friendly"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Completed and unified the JSON‑based metadata infrastructure for all tools (titles, descriptions, canonical links and JSON‑LD structured data) in both Persian and English",
          "Refined the Docs page structure with a categorized sidebar, dedicated icons per category and bilingual content loading from JSON files for better maintainability",
          "Further separated server and client layers on tool pages to make Fast Refresh more stable, reduce errors caused by calling client functions from the server and prepare the codebase for future features"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed an issue in the Docs sidebar where selecting some entries immediately jumped back to the first document instead of keeping the selected one",
          "Resolved several metadata/JSON‑LD issues in PDF‑related tools (such as PDF merge) that were caused by calling client‑side helpers from server components during build/development",
          "Improved consistency of translations and rendering for newer categories (such as Presentation) across the Persian and English versions of Docs and related tools"
        ]
      }
    ]
  },
  {
    "version": "2.2.0 BETA",
    "date": "December 8, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added centralized, bilingual metadata for all tool pages using a JSON-based structure",
          "Introduced JSON-LD (Structured Data) support to improve SEO for tools",
          "Exposed version and changelog information more clearly in the UI for better transparency"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Unified the architecture of tool pages by fully separating server and client layers",
          "Improved page load performance by handling metadata generation on the server",
          "Better synchronization between Persian and English content in tool descriptions and changelog entries"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed several issues when reading metadata for some tools during the build step",
          "Resolved minor inconsistencies in text rendering between light and dark themes"
        ]
      }
    ]
  },
  {
    "version": "2.1.0 BETA",
    "date": "December 7, 2025",
    "type": "update",
    "changes": [
      {
        "category": "improved",
        "items": [
          "Redesigned the site header with a glassmorphic style and floating controls for a more modern look",
          "Better light and dark theme consistency between the desktop header and the mobile menu",
          "Minor visual refinements on tools pages for improved readability and overall UI cohesion",
          "Smoother user experience when navigating between pages and working with tools"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed several reported issues in the mobile navigation and language switcher",
          "More stable behavior during long sessions when using multiple tools in parallel"
        ]
      }
    ]
  },
  {
    "version": "2.0.0 BETA",
    "date": "December 7, 2025",
    "type": "major",
    "changes": [
      {
        "category": "added",
        "items": [
          "Experimental bilingual interface (Persian / English) for tools",
          "New JSON-based content structure for per-tool UI texts",
          "Improved organization and categorization of tools across the site"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Refactored core parts of the project to support future big updates",
          "Better light and dark theme consistency between tools",
          "Improved performance and responsiveness on tools pages"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Resolved several known issues from previous versions",
          "More stable behavior when using multiple tools in one session"
        ]
      }
    ]
  },
  {
    "version": "1.4.1",
    "date": "December 6, 2025",
    "type": "release",
    "changes": [
      {
        "category": "improved",
        "items": [
          "First stable release after the beta phase",
          "Final polish for a smoother user experience",
          "Minor UI refinements in selected tools"
        ]
      },
      {
        "category": "note",
        "items": ["English UI language is not available yet in this version"]
      }
    ]
  },
  {
    "version": "1.4.0 BETA",
    "date": "December 5, 2025",
    "type": "update",
    "changes": [
      {
        "category": "improved",
        "items": [
          "General performance improvements and better app stability",
          "Optimized some internal processing across tools",
          "Prepared the codebase for the upcoming stable release"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed several reported bugs in different tools",
          "Reduced random errors when working with very large files"
        ]
      }
    ]
  },
  {
    "version": "1.3.1 BETA",
    "date": "December 5, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Added Audio Editor with trimming and WAV export",
          "Fade in and fade out options for smoother audio transitions",
          "New changelog page to track all updates"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Improved Docs layout and descriptions",
          "Better tool cards layout on mobile and tablet",
          "Updated audio tool colors for light and dark themes"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed minor issues in Word to PDF with Persian fonts",
          "Fixed some icons not rendering in older browsers",
          "Improved error handling for very large PDF and image files"
        ]
      }
    ]
  },
  {
    "version": "1.3.0 BETA",
    "date": "December 5, 2025",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Color Picker with palette extraction",
          "Code Visualizer for JavaScript and C#",
          "Text to PDF with full Persian font support",
          "Image Compressor with optimized compression",
          "25+ useful tools across different categories"
        ]
      },
      {
        "category": "improved",
        "items": [
          "Overall site performance improvements",
          "More modern UI design",
          "Full dark mode support",
          "Better mobile experience"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "Fixed browser compatibility issues",
          "Improved processing of large files"
        ]
      }
    ]
  }
]
