[
  {
    "version": "2.7.1 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "افزودن نوار شناور جدید در پایین صفحه برای موبایل با یک دکمه‌ی مستقیم «مستندات» و یک منوی کوچک به سبک FAB برای دسترسی سریع به سایر صفحات",
          "اضافه شدن هدر و فوتر شیشه‌ای (Glassmorphism) برای هم‌خوانی بیشتر با هویت بصری جدید ToolsManager"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بهینه‌سازی چیدمان بخش ابزارها در موبایل؛ دسته‌بندی‌ها حالا به صورت ردیف افقی چِیپ‌ها نمایش داده می‌شوند و متن دکمهٔ دعوت به استفاده بدون نیاز به Hover همیشه قابل مشاهده است",
          "تنظیم فاصله‌ها و Padding‌ های انتهای صفحات موبایل تا محتوا زیر نوار شناور پایین صفحه مخفی نشود",
          "بهبود موقعیت منوی انتخاب تم (Theme Switcher) تا در هر دو حالت فارسی (RTL) و انگلیسی (LTR) همیشه داخل صفحه بماند و از کادر خارج نشود",
          "یکنواخت‌سازی استایل اسکرول‌بار در کل سایت با یک اسکرول‌بار ساده و هماهنگ با تم"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع چند مشکل جزئی در هم‌تراز نبودن بعضی کارت‌ها و محتوای فوتر هنگام تغییر بین تم روشن و تیره",
          "برطرف شدن باگی که در بعضی اندازه‌های خیلی کوچک صفحه باعث می‌شد دکمه‌های نوار پایین موبایل کمی روی محتوای اصلی بیفتند"
        ]
      }
    ]
  },
  {
    "version": "2.7.0 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "اضافه شدن امکان بارگذاری تصویر از طریق لینک (URL) در ابزارهای تصویر از جمله «تغییر اندازه تصویر»، «فشرده‌سازی تصویر» و «تبدیل تصویر به PDF» با پردازش کامل سمت کلاینت و بدون آپلود فایل به سرور",
          "اضافه شدن ابزار جدید «ویرایشگر تصویر» با قابلیت‌های پایه‌ای مانند کراپ، چرخش، معکوس‌سازی (Flip)، تنظیم روشنایی و کنتراست و اعمال فیلترهای ساده روی تصویر",
          "تعریف متادیتای متمرکز و دو‌زبانه برای ابزار «ویرایشگر تصویر» شامل عنوان، توضیحات، لینک canonical و JSON‑LD برای سئوی بهتر",
          "افزودن بخش مستقل برای ابزار ویرایشگر تصویر در صفحه مستندات (Docs) با توضیحات فنی، مثال‌های استفاده و نکات حریم خصوصی"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بهبود نام‌گذاری خروجی در ابزارهای تصویری با استفاده از الگوی شفاف‌تر مثل «edited-{timestamp}.{ext}» و «resized-{عرض}x{ارتفاع}.{ext}» بر اساس نوع واقعی فایل (MIME Type)",
          "هماهنگ‌سازی و یکدست‌سازی پیام‌های حریم خصوصی در تمام ابزارهای تصویر (Resize, Compress, Image to PDF, Image to SVG و Image Editor) با تأکید بر پردازش ۱۰۰٪ سمت کلاینت",
          "بهینه‌سازی مصرف حافظه و مدیریت Blob/File در ابزارهای تصویر برای جلوگیری از نشت حافظه هنگام تعویض چندباره تصویر و بستن/باز کردن ابزار",
          "بهبود پیام‌های خطا و راهنمایی کاربر هنگام بارگذاری تصویر از URL (نمایش خطای قابل‌فهم برای خطاهای CORS، لینک نامعتبر یا فرمت غیرتصویری)"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع مشکل شناسایی اشتباه پسوند فایل خروجی در ابزار تغییر اندازه تصویر هنگام بارگذاری از برخی لینک‌های بدون پسوند یا با Query String طولانی",
          "حل باگ باقی ماندن پیش‌نمایش قبلی در ابزار تغییر اندازه تصویر و فشرده‌سازی تصویر پس از پاک کردن فایل و انتخاب تصویر جدید",
          "رفع ناسازگاری جزئی در استایل نوت‌های اطلاع‌رسان (info / warning / error) در صفحه مستندات هنگام تغییر تم روشن/تیره",
          "برطرف شدن چند مورد کرش ناگهانی در ابزارهای تصویر هنگام کار با تصاویر با ابعاد بسیار بزرگ به دلیل عدم مدیریت مناسب استثناهای Canvas"
        ]
      }
    ]
  },
  {
    "version": "2.6.0 BETA",
    "date": "19 آذر 1404",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "اضافه شدن ابزار جدید «استخراج صدا از ویدیو» با پشتیبانی از فرمت‌های ورودی MP4، AVI، MOV، MKV و WEBM و خروجی در چهار فرمت MP3، WAV، OGG و M4A",
          "قابلیت انتخاب سه سطح کیفیت صدا (کم، متوسط، بالا) با نمایش بیت‌ریت متناسب برای هر فرمت خروجی",
          "نمایش نوار پیشرفت درصدی در طول فرایند استخراج صدا به همراه پیام‌های راهنما برای جلوگیری از سردرگمی کاربر",
          "استفاده از FFmpeg.wasm برای پردازش کامل سمت کلاینت بدون نیاز به آپلود فایل به سرور",
          "نمایش خودکار مدت زمان و حجم فایل ویدیویی پس از بارگذاری",
          "هشدار مهم قبل از شروع استخراج درباره زمان‌بر بودن پردازش ویدیوهای بزرگ و احتمال کند شدن موقت مرورگر",
          "پیام اطلاع‌رسانی در حین پردازش برای یادآوری صبر کاربر و عدم بستن پنجره مرورگر",
          "تعریف متادیتای کامل دو‌زبانه برای ابزار استخراج صدا شامل عنوان، توضیحات، لینک canonical و JSON‑LD",
          "افزودن بخش مستقل برای ابزار استخراج صدا در صفحه مستندات (Docs) با توضیحات فنی کامل و نکات حریم خصوصی"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بهبود ابزار «تغییر اندازه تصویر» با اضافه شدن پیش‌نمایش زنده تصویر، نمایش ابعاد فعلی در کنار ابعاد اصلی و دکمه بازگشت به اندازه اصلی",
          "اضافه شدن واحد پیکسل (px) به ورودی‌های عرض و ارتفاع در ابزار تغییر اندازه تصویر برای وضوح بیشتر",
          "بهبود نمایش وضعیت قفل نسبت تصویر با نوت آبی اطلاع‌رسانی که توضیح می‌دهد تغییر یک بعد، بعد دیگر را خودکار تنظیم می‌کند",
          "جداسازی کامل محتوای UI ابزار تغییر اندازه تصویر به فایل‌های JSON دو‌زبانه و حذف تمام متن‌های هاردکد از کامپوننت اصلی",
          "بهبود مدیریت حافظه در ابزار تغییر اندازه تصویر با استفاده از FileReader و readAsDataURL به‌جای URL.createObjectURL برای نمایش پیش‌نمایش",
          "افزودن انیمیشن‌های نرم با Framer Motion در هنگام تغییر حالت بین آپلود و ویرایش در ابزار تغییر اندازه تصویر",
          "بهبود کیفیت خروجی تصویر با تنظیم imageSmoothingQuality به «high» و quality به 0.95 در ابزار تغییر اندازه",
          "تغییر نام فایل خروجی به فرمت «resized-{عرض}x{ارتفاع}.{پسوند}» برای شفافیت بیشتر"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع خطای «ffmpeg.wasm does not support nodejs» با dynamic import کردن FFmpeg فقط در سمت کلاینت و جلوگیری از اجرای آن در زمان SSR",
          "حل مشکل عدم نمایش پیش‌نمایش تصویر در ابزار تغییر اندازه با تغییر روش بارگذاری از URL.createObjectURL به FileReader",
          "رفع باگ عدم نمایش هشدارها و پیام‌های راهنما در ابزار استخراج صدا به دلیل عدم آپدیت فایل‌های JSON ترجمه",
          "حذف state اضافی isClient که باعث عدم رندر کامپوننت در اولین بارگذاری می‌شد و جایگزینی آن با چک ساده typeof window"
        ]
      }
    ]
  },
  {
    "version": "2.5.5 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "اضافه شدن ابزار «تبدیل تصویر به SVG وکتور» در دسته‌ی تصویر، با تبدیل کامل سمت کلاینت (Canvas + ImageTracerJS)، پیش‌نمایش هم‌زمان تصویر اصلی و خروجی SVG و امکان دانلود مستقیم فایل SVG برای ویرایش در ابزارهای وکتور [web:242]",
          "تعریف متادیتای دو‌زبانه و ساختار JSON‑محور برای ابزار جدید «تبدیل تصویر به SVG» شامل عنوان، توضیحات، لینک canonical، JSON‑LD و بخش مستقل در صفحه مستندات (Docs)"
        ]
      },
      {
        "category": "improved",
        "items": [
          "گسترش سیستم تم با توکن‌های اختصاصی برای نوت‌ها و هشدارها (info / warning / error) و استفاده از آن‌ها در Docs و ابزارها به‌جای کلاس‌های رنگی هاردکد، برای هماهنگی بهتر بین تم روشن و تیره",
          "افزودن پیکربندی تم برای اسکرول‌بار و خطوط جداکننده (Divider) و اعمال آن در صفحه مستندات برای اسکرول‌بار و دیوایدر هماهنگ با تم و بدون رنگ‌های ثابت",
          "انتقال تمام متن‌های ابزار «تبدیل تصویر به SVG» (از جمله هشدار مهم درباره ابعاد تصویر و نکات کارایی) به فایل‌های ترجمه JSON و یکپارچه‌سازی کامل با LanguageContext و سیستم i18n پروژه",
          "به‌روزرسانی کامپوننت‌های مستندات (DocSection) برای استفاده از رنگ‌های نوت و هشدار از روی تم سراسری، به‌جای استفاده از کلاس‌های زرد و سبز هاردکد‌شده در حالت روشن/تاریک"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع خطای TypeScript در زمان بیلد مرتبط با کتابخانه imagetracerjs با اضافه کردن فایل تعریف نوع (.d.ts) و جلوگیری از implicit any برای ماژول تبدیل تصویر به SVG [web:242]",
          "حذف متن‌ها و استایل‌های هاردکد باقی‌مانده در برخی بخش‌های Docs و ابزارهای تصویر و هم‌راستا کردن آن‌ها با سیستم تم و ترجمه‌ی مرکزی پروژه"
        ]
      }
    ]
  },
  {
    "version": "2.5.0 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "اضافه شدن ابزار «تبدیل HTML به پاورپوینت (PPTX)» با پشتیبانی از چند اسلاید، تشخیص خودکار تیترها، پاراگراف‌ها، لیست‌ها و جداول ساده و نگاشت آن‌ها به اسلایدهای قابل ویرایش در پاورپوینت",
          "امکان ساخت فایل‌های PPTX به‌صورت کامل در مرورگر، بدون نیاز به آپلود روی سرور یا نصب نرم‌افزار جانبی، برای حفظ حریم خصوصی و سرعت بیشتر"
        ]
      },
      {
        "category": "improved",
        "items": [
          "تکمیل و یکپارچه‌سازی زیرساخت JSON‑محور متادیتا برای همه ابزارها (عنوان، توضیحات، لینک‌های canonical و داده‌های ساختاریافته JSON‑LD) به‌صورت دو‌زبانه",
          "بازطراحی و یکپارچه‌سازی ساختار صفحه مستندات (Docs) با منوی سایدبار دسته‌بندی‌شده، آیکون‌های اختصاصی برای هر دسته و لود شدن متن‌ها از روی فایل‌های JSON فارسی و انگلیسی",
          "بهبود جداسازی لایه سرور و کلاینت در صفحات ابزارها برای پایدارتر شدن Fast Refresh، کاهش خطاهای مربوط به صدا زدن توابع کلاینت از سرور و آماده‌سازی بهتر برای توسعه فیچرهای بعدی"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع مشکل انتخاب‌نشدن صحیح برخی آیتم‌ها در سایدبار صفحه مستندات و بازگشت خودکار به اولین آیتم پس از کلیک روی سایر مستندات",
          "حل چند خطای مرتبط با متادیتا و JSON‑LD در ابزارهای PDF (مثل ادغام PDF) که به خاطر فراخوانی توابع کلاینت در سمت سرور در زمان بیلد/دولوپمنت رخ می‌داد",
          "بهبود هماهنگی ترجمه و نمایش دسته‌بندی‌های جدید (مثل Presentation) بین نسخه‌های فارسی و انگلیسی در Docs و ابزارهای مرتبط"
        ]
      }
    ]
  },
  {
    "version": "2.2.0 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "افزودن متادیتای متمرکز و دو‌زبانه برای صفحات ابزارها با ساختار JSON",
          "اضافه شدن پشتیبانی از JSON‑LD (Structured Data) برای سئوی بهتر ابزارها",
          "نمایش نسخه و تاریخچه تغییرات در رابط کاربری (بهبود شفافیت توسعه)"
        ]
      },
      {
        "category": "improved",
        "items": [
          "یکپارچه‌سازی ساختار صفحات ابزارها با جداسازی کامل لایه سرور و کلاینت",
          "بهبود سرعت بارگذاری صفحات ابزارها با مدیریت بهتر متادیتا در سمت سرور",
          "هماهنگ‌سازی بهتر محتوای فارسی و انگلیسی در توضیحات ابزارها و چنجلگ"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع چند مشکل در خواندن متادیتا برخی ابزارها هنگام بیلد",
          "برطرف شدن ناسازگاری جزئی در نمایش متن‌ها بین تم روشن و تیره"
        ]
      }
    ]
  },
  {
    "version": "2.1.0 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "improved",
        "items": [
          "بازطراحی هدر سایت با استایل شیشه‌ای و دکمه‌های معلق برای تجربه بصری مدرن‌تر",
          "هماهنگ‌سازی بهتر هدر دسکتاپ و منوی موبایل با تم روشن و تیره",
          "بهبودهای ظاهری جزئی در صفحات ابزارها برای خوانایی و یکپارچگی بیشتر رابط کاربری",
          "روان‌تر شدن تجربه کاربری در ناوبری بین صفحات و کار با ابزارها"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع چند باگ گزارش‌شده در منوی موبایل و تغییر زبان",
          "پایداری بیشتر هنگام کار طولانی‌مدت با چند ابزار به‌صورت هم‌زمان"
        ]
      }
    ]
  },
  {
    "version": "2.0.0 BETA",
    "date": "—",
    "type": "major",
    "changes": [
      {
        "category": "added",
        "items": [
          "افزودن نسخه‌ی آزمایشی رابط کاربری دو‌زبانه (فارسی / انگلیسی) برای ابزارها",
          "اضافه شدن ساختار جدید JSON‑محور برای مدیریت متن‌های هر ابزار",
          "امکان توسعه و دسته‌بندی بهتر ابزارها در بخش‌های مختلف سایت"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بازطراحی بخشی از هسته پروژه برای پشتیبانی از به‌روزرسانی‌های بزرگ آینده",
          "هماهنگ‌سازی بهتر تم روشن و تیره در بین ابزارهای مختلف",
          "بهبود عملکرد و واکنش‌گرایی رابط کاربری در صفحات ابزارها"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع تعدادی از باگ‌های شناخته‌شده در نسخه‌های قبلی",
          "پایداری بیشتر هنگام کار هم‌زمان با چند ابزار"
        ]
      }
    ]
  },
  {
    "version": "1.4.1",
    "date": "—",
    "type": "release",
    "changes": [
      {
        "category": "improved",
        "items": [
          "انتشار اولین نسخه پایدار پس از دوره بتا",
          "بهینه‌سازی نهایی برای تجربه کاربری روان‌تر",
          "بهبود جزئی رابط کاربری در چند ابزار منتخب"
        ]
      },
      {
        "category": "note",
        "items": ["در این نسخه هنوز زبان انگلیسی به رابط کاربری اضافه نشده است"]
      }
    ]
  },
  {
    "version": "1.4.0 BETA",
    "date": "—",
    "type": "update",
    "changes": [
      {
        "category": "improved",
        "items": [
          "بهبود عملکرد کلی و افزایش پایداری برنامه",
          "بهینه‌سازی برخی پردازش‌های داخلی ابزارها",
          "آماده‌سازی زیرساخت برای نسخه پایدار بعدی"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع چند باگ گزارش‌شده در ابزارهای مختلف",
          "کاهش خطاهای ناگهانی هنگام کار با فایل‌های حجیم"
        ]
      }
    ]
  },
  {
    "version": "1.3.1 BETA",
    "date": "14 آذر 1404",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "اضافه شدن ویرایشگر صوت (Audio Editor) با امکان برش صدا و خروجی WAV",
          "قابلیت Fade In و Fade Out برای نرم‌تر شدن شروع و پایان صدا",
          "صفحه تاریخچه تغییرات (Changelog) برای مشاهده آپدیت‌های نسخه‌ها"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بهبود طراحی و توضیحات مستندات ابزارها در صفحه Docs",
          "بهینه‌سازی نمایش کارت ابزارها در موبایل و تبلت",
          "هماهنگ‌سازی رنگ‌بندی ابزار جدید صوت با تم روشن و تیره"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع چند باگ جزئی در ابزار تبدیل Word به PDF هنگام استفاده از فونت‌های فارسی",
          "رفع مشکل رندر برخی آیکون‌ها در مرورگرهای قدیمی‌تر",
          "بهبود مدیریت خطا در زمان بارگذاری فایل‌های بسیار بزرگ در ابزارهای PDF و تصویر"
        ]
      }
    ]
  },
  {
    "version": "1.3.0 BETA",
    "date": "14 آذر 1404",
    "type": "update",
    "changes": [
      {
        "category": "added",
        "items": [
          "Color Picker با قابلیت استخراج پالت رنگی",
          "Code Visualizer برای JavaScript و C#",
          "Text to PDF با پشتیبانی کامل از فونت فارسی",
          "Image Compressor با فشرده‌سازی بهینه",
          "25+ ابزار کاربردی در دسته‌های مختلف"
        ]
      },
      {
        "category": "improved",
        "items": [
          "بهبود عملکرد کلی سایت",
          "طراحی رابط کاربری مدرن‌تر",
          "پشتیبانی کامل از حالت تاریک",
          "بهینه‌سازی برای موبایل"
        ]
      },
      {
        "category": "fixed",
        "items": [
          "رفع مشکلات سازگاری با مرورگرهای مختلف",
          "بهبود پردازش فایل‌های بزرگ"
        ]
      }
    ]
  }
]
